'use strict'


// Мінімум

// Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

console.log(((0.1 * 100) + (0.2 * 100)) / 100);

// Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

const str = "1";
const num = 2;
console.log(+str + num);

// Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

const SIZE_1GB = 1000;
const FILE = 820;
let userSize = prompt("Який обсяг вашої флешки? Наприклад:", "2");
console.log(~~(userSize * SIZE_1GB / FILE));

// Норма

// Користувач вводить суму грошей в гаманці і ціну однієї шоколадки.
// Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.

let money = prompt("Cума грошей в гаманці? Наприклад:", "200");
let prise = prompt("Ціна однієї шоколадки? Наприклад:", "50");
let quantity = ~~(money / prise);
let remainder = money - (quantity * prise);
console.log("Кількість товарів: " + quantity + " Ваш залишок: " + remainder);

// Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення).

let value = +prompt("Введіть тризначне число. Наприклад:");
let num1 = (value - value % 100) / 100;
let num2 = (value - value % 10) / 10;
let num3 = (value - value % 1) / 1;
console.log(num3, num2, num1);





// Максимум

// Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.

const rate = +( 5 / 12 ).toFixed(2);
const month = 2;
let amount = +prompt("Яка сумма вкладу? Наприклад: 2000");
let enter = amount * (rate * month) / 100;
console.log(enter);


// Що повернуть вирази:

//  2 && 0 && 3 //  0

//  2 || 0 || 3 // 2

// 2 && 0 || 3 // 0
